<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
<title>MidnightBSD :: Dokumentation :: MPorts :: Fake</title>
<link rel="stylesheet" type="text/css" media="all" href="/css/base.css" />
</head>

<body>

<!-- BEGIN HEADER -->
<div id="header">
    <span id="logo">
	    <img src="/images/mbsd_newlogo.png" alt="MidnightBSD [logo]" />
	</span>  
</div>
<!-- END HEADER -->

<div id="content">

<div id="rnav">
        <ul>
            <li><a href="/de/index.html" title="Startseite">Startseite</a></li>
            <li><a href="/de/about/index.html" title="&Uuml;ber MidnightBSD">Info</a></li>
            <li><a href="/de/download/index.html" title="MidnightBSD Bezugsquellen">Bezugsquellen</a></li>
            <li><a href="/de/docs/index.html" title="Dokumentation">Dokumentation</a></li>

            <li><a href="/de/community/index.html" title="Community">Community</a></li>
            <li><a href="/developer/index.html" title="Entwicklung">Entwicklung</a></li>
            <li><a href="/de/support/index.html" title="Hilfe">Hilfe</a></li>
        </ul>

	<p><a href="/index.html" title="English">EN</a>
	   <a href="/ru/index.html" title="Russian">RU</a>
	   <a href="/de/index.html" title="German">DE</a>
	</p>
</div>

 <h2>Das MPort Fake-System</h2>
 
 <h3>Einf&uuml;hrung</h3>
 
 <p>
 Das Fake-System ist eine gro&szlig;e Ver&auml;nderung der MPorts, wodurch viele
 der Ports instabil wurden. Diese Seite soll Entwicklern dabei helfen,
 Fehlermeldungen des Fake-Systems besser verstehen und beheben zu k&ouml;nnen.
 </p>
 
 <p>Das Fake-System installiert einen Port in den folgenden Schritten:</p>
 
 <ol>
    <li>
    Der Port wird wie &uuml;blich heruntergeladen, gepatcht, konfiguriert und gebaut.
    Bei diesen Schritten wurden keine Ver&auml;nderungen vorgenommen.
    </li>
 
    <li>
    Der Port wird in ein tempor&auml;res Verzeichnis <code>FAKE_DESTDIR</code>
    installiert. &Uuml;blicherweise ist dies <code>${WRKDIR}/fake-inst-${ARCH}</code>.
    <br />Im Einzelnen passiert dabei folgendes:
 <ol>
    
    <li>
    Das Verzeichnis <code>${FAKE_DESTDIR}/${PREFIX}</code> wird erstellt und in diesem
    mittels <code>mtree</code> eine Verzeichnisstruktur erzeugt.
    </li>

    <li>
    Das Target pre-fake wird aufgerufen. Dieses Target l&auml;uft in der normalen
    Umgebung ab.
    </li>
    
    <li>
    Das Target pre-install (falls vorhanden) wird aufgerufen. Dieses Target
    l&auml;uft <em>nicht</em> in einer normalen Umgebung ab. Stattdessen haben
    verschiedene Variablen ein vorangestelltes <code>FAKE_DESTDIR</code>.
    Die betroffenen Variablen sind <code>PREFIX</code>, <code>LINUXBASE</code>, 
    und <code>KMODDIR</code>. <code>PREFIX</code> wird wiederum in vielen
    anderen Variablen mit eingebunden, wodurch im Endeffekt fast s&auml;mtliche
    w&auml;hrend einer Installation verwendeten Variablen automatisch
    angepa&szlig;t werden. Dies bedeutet, das ein pre-install Target ohne
    weitere &Auml;nderungen etwas wie <pre>${CP} myconfig ${PREFIX}/etc</pre>
    verwenden kann. Der echte Pr&auml;fix wird in der Variablen
    <code>TRUE_PREFIX</code> gespeichert.
    </li>
    
    <li>
    Das Target pre-su-install (falls vorhanden) wird in der Fake-Umgebung
    aufgerufen.
    </li>
    
    <li>
    Standardm&auml;&szlig;ig wird das dist-Makefile (das Makefile in
    <code>WRKSRC</code>) wie folgt aufgerufen (zur besseren Lesbarkeit
    vereinfacht dargestellt): 
    <pre>make DESTDIR=${FAKE_DESTDIR} install</pre>
    Falls Ihr Port ein eigenes do-install Target besitzt, wird dieses
    stattdessen in der Fake-Umgebung aufgerufen.
    </li>
    
    <li>
    Das Target post-install (falls vorhanden) wird in der Fake-Umgebung
    aufgerufen.
    </li>
    
    <li>
    Das Target post-fake wird in der normalen Umgebung aufgerufen.
    </li>
    
 </ol>
 
 <li>
 Es wird ein Paket mit den Dateien in <code>FAKE_DESTDIR</code> erstellt.
 </li>
 
 <li>Dieses Paket wird installiert.</li>
 
 </ol>
 
 <h3>Falls etwas schief geht</h3>
 
 <p>
 Wenn ein Fehler durch die Verwendung des Fake-Systems entsteht, dann
 tritt dieser als erstes auf, wenn die Manpages komprimiert werden
 sollen. Die Komprimierung der Manpages ist der erste Schritt, welcher
 eine korrekte Installation der Dateien in <code>FAKE_DESTDIR</code>
 erwartet. Es gibt mehrere Gr&uuml;nde, warum eine Fake-Installation
 scheitern kann. Die h&auml;ufigsten Ursachen werden im folgenden
 n&auml;her erl&auml;utert.
 </p>
 
 <h4>Keine Unterst&uuml;tzung von DESTDIR</h4>
 
 <p>
 Die Variable <code>DESTDIR</code> wird von vielen Projekten f&uuml;r
 eine schrittweise Installation verwendet, unter anderem auch von uns.
 <code>DESTDIR</code> wird jedem Installationsverzeichnis vorangestellt.
 Die <a href="http://www.gnu.org/prep/standards/html_node/DESTDIR.html">GNU Coding Standards page on <code>DESTDIR</code></a>
 stellt eine exzellente Referenz dar.
 </p>
 
 <p>
 Viele aktuelle Projekte, welche die GNU build Tools verwenden (insbesondere
 solche die automake verwenden), unterst&uuml;tzen <code>DESTDIR</code>,
 ebenso Perl-, Ruby- und GNUstep-Module sowie andere Projekte. Unserer
 Erfahrung nach unterst&uuml;tzen ca. 75% unserer Ports DESTDIR.
 </p>
 
 <p>
 Manchmal wird DESTDIR nicht unterst&uuml;tzt. Dann ist es n&ouml;tig ein
 oder zwei Anpassungen vorzunehmen. Falls das Projekt klein ist k&ouml;nnte
 es schon ausreichen, das Makefile anzupassen. Zum Beispiel ist folgendes
 ironischerweise ein Patch f&uuml;r GNU patch:
 </p>
 
 <pre> install:: all installdirs
-       $(INSTALL_PROGRAM) patch$(EXEEXT) $(bindir)/$(patch_name)$(EXEEXT)
-       -$(INSTALL_DATA) $(srcdir)/patch.man $(man1dir)/$(patch_name)$(man1ext)
+       $(INSTALL_PROGRAM) patch$(EXEEXT) ${DESTDIR}$(bindir)/$(patch_name)$(EXEEXT)
+       -$(INSTALL_DATA) $(srcdir)/patch.man ${DESTDIR}$(man1dir)/$(patch_name)$(man1ext)

 installdirs::
-       $(SHELL) $(srcdir)/mkinstalldirs $(bindir) $(man1dir)
+       $(SHELL) $(srcdir)/mkinstalldirs ${DESTDIR}$(bindir) ${DESTDIR}$(man1dir)</pre>

 <p>
 Ein schneller und schmutziger Hack w&uuml;rde darin bestehen, <code>prefix</code>
 im Makefile des Ports zu &uuml;berschreiben:
 </p>
 
 <pre>FAKE_MAKEARGS+= prefix=${FAKE_DESTDIR}${PREFIX}</pre>
 
 <p>
 Dies funktioniert, solange Sie nicht configure mit einem zus&auml;tzlichen
 <code>exec_prefix</code> verwenden.
 </p>

 <p>
 Manchmal hat <code>DESTDIR</code> auch einfach einen anderen Variablennamen,
 h&auml;fig z.B. <code>INSTALL_ROOT</code>. In so einem Fall m&uuml;ssen Sie
 einfach die Variable <code>DESTDIRNAME</code> entsprechend setzen.
 </p>

 <h4>Fehlerhafte Unterst&uuml;tzung von DESTDIR</h4>

 <p>
 Die Unterst&uuml;tzung von <code>DESTDIR</code> kann manchmal f&uuml;r den
 Autor trickreich sein. Selbst kleinste Fehler k&ouml;nnen unter Umst&auml;nden
 zu defekten Ports f&uuml;hren. Solche Fehler zu beheben kann f&uuml;r den
 Port Maintainer eine echte Herausforderung sein, da sich dieser in den
 gesamten Installationsproze&szlig; der Software einarbeiten mu&szlig;.
 </p>

 <p>
 Pakete, die automake verwenden, &quot;funktionieren h&auml;ufig einfach&quot;.
 Trotzdem vergessen Autoren h&auml;ufig die Unterst&uuml;tzung von
 <code>DESTDIR</code> bei selbstgestrickten Targets. Jedes solcher Targets
 mu&szlig; dann vom Maintainer angepa&szlig;t werden.
 </p>

 <p>
 Falls Ihr Paket eine Bin&auml;rdatei ausf&uuml;hren mu&szlig;, um z.B.
 Dateien w&auml;hrend der Installation zu erzeugen, <em>k&ouml;nnte</em>
 es n&ouml;tig sein, diesen Schritt in ein pkg-install Skript auszulagern.
 Dies h&auml;ngt davon ab, ob die betreffende Bin&auml;rdatei nach einer
 endg&uuml;ltigen Installation aufgerufen werden mu&szlig;. Es gibt
 hierbei keine festen Regeln. Als Port Maintainer m&uuml;ssen Sie
 entscheiden wie Sie das Problem beheben. Wenn Sie in Ihrem Pfad auch
 Bin&auml;rdateien, welche &uuml;ber eine Fake-Installation installiert
 wurden, ben&ouml;tigen, so k&ouml;nnen Sie die Option <code>bin</code>
 wie folgt verwenden: <code>FAKE_OPTS= bin</code>
 </p>

 <p>
 Manchmal erwartet ein Paket, dass es w&auml;hrend der Installation
 gegen seine eigenen, gemeinsam genutzten, Bibliotheken linken kann.
 Dies wird fehlschlagen da der Linker nichts &uuml;ber
 <code>FAKE_DESTDIR</code> wei&szlig; und auch nicht sollte. Setzen
 Sie in diesem Fall die Option <code>libs</code> wie folgt:
 <code>FAKE_OPTS= libs</code>
 </p>

 <p>
 Die meisten Ports werden es nicht erlauben, <code>DESTDIR</code>
 und <code>PREFIX</code> (man achte auf die Gro&szlig;schreibung)
 gleichzeitig zu &uuml;berschreiben. Falls Ihr Paket dies doch
 tut, so m&uuml;ssen Sie die Option <code>trueprefix</code>
 setzen, da <code>PREFIX</code> normalerweise durch
 <code>${FAKE_DESTDIR}${PREFIX}</code> ersetzt wird.
 </p>
 
 <h4>Bin&auml;re Ports</h4>

 <p>
 Bin&auml;re Ports stellen aufgrund Ihrer un&uuml;blichen
 Installationsvorg&auml;nge ein Problem dar. Sie sind
 h&auml;ufig sehr speziell. Es k&ouml;nnte in solch einem
 Fall einfach sein, ein do-install Target zu erstellen,
 anstatt die mitgelieferten Installationsskripte
 anzupassen.
 </p>
 
 <h4>GNUstep Ports</h4>

 <p>
 Wir verwenden jetzt GNUstep-make 2.0, welcher eine sehr gute Unterst&uuml;tzung
 von <code>DESTDIR</code> bietet. GNUstep-make 2.0 erzeugt keine
 <code>library_paths.openapp</code>-Datei mehr. Diese Datei wurde die letzten
 Jahre &uuml;ber nicht mehr verwendet. Sie sollten daher sicherstellen das
 sie nicht mehr in Ihrer plist-Datei auftaucht.
 </p>

 <h3>Anmerkungen</h3>

 <p>
 &Uuml;blicherweise tendierten Port Makefiles dazu, die Arbeitsschritte
 von <code>pkg_add</code> zu reproduzieren, z.B. indem das pkg-install Skript
 ausgef&uuml;hrt oder pkg-message angezeigt wurde. Makefiles sollten dies
 nicht mehr tun.
 </p>

 <p>
 Der gr&ouml;&szlig;te Teil des Subsystems (z.B. das Linux-RPM- oder das
 Python-Subsystem) wurde so modifiziert, das er mit dem Fake-System
 funktioniert. Manche m&uuml;ssen noch angepa&szlig;t werden. Wenn Sie
 ein noch nicht angepa&szlig;tes Subsystem ben&ouml;tigen kontaktieren
 Sie bitte ctriv@ bevor Sie irgendwelche Anpassungen einchecken.
 </p>

 <p>
 Wenn Ihr Linux-Port etwas mit den falschen Zugriffsrechten installiert
 sollten Sie sicherstellen, da&szlig; Sie die aktuellste Version von
 <code>cpio</code> verwenden.
 </p>
 
</div>
<!-- END CONTENT -->

<!-- BEGIN FOOTER -->
<div id="footer">
    <p id="footertext"><a href="/copyright/index.html">Legal Notices</a> | Copyright 2005-2007 Lucas Holt
    <br />$MidnightBSD: www/docs/mports/fake.html,v 1.2 2007/05/20 20:24:34 laffer1 Exp $
    </p>

    <script src="http://www.google-analytics.com/urchin.js" type="text/javascript">
    </script>
    <script type="text/javascript">
    _uacct = "UA-560995-2";
    urchinTracker();
    </script>
</div>
<!-- END FOOTER -->
</body>
</html>
